In [87]:
import pandas as pd
import numpy as np
import re
import collections

In [5]:
df = pd.read_csv('titanic.csv', index_col='PassengerId')
df.head(5)

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

##### 1. Количество мужчин и женщин на Титанике

In [16]:
print('Количество мужчин на Титанике - ', df[df['Sex'] == 'male'].shape[0])
print('Количество женщин на Титанике - ', df[df['Sex'] == 'female'].shape[0])

Количество мужчин на Титанике -  577
Количество женщин на Титанике -  314

##### 2. Доля выживших пассажиров

In [19]:
print('Доля выживших пассажиров = ', round(df[df['Survived'] == 1].shape[0] / df.shape[0] * 100, 2), '%', sep='')

Доля выживших пассажиров = 38.38%

##### 3. Доля пассажиров первого класса

In [132]:
print('Доля пассажиров первого класса = ', round(df[df['Pclass'] == 1].shape[0] / df.shape[0] * 100, 2), '%', sep='')

Доля пассажиров первого класса = 24.24%

###### 4. Возраст пассажиров

In [130]:
print('Средний возраст пассажиров - ', round(df['Age'].mean(), 2))
print('Медиана возраста пассажиров - ', round(df['Age'].median()))

Средний возраст пассажиров -  29.7
Медиана возраста пассажиров -  28

###### 5. Корреляция числа братьев/сестер (SibSp) с числом родителей/детей (Parch)

In [40]:
correlation = df[['SibSp', 'Parch']].corr(method='pearson')
print('Корреляция равна = ', round(correlation.unstack()[1], 2))
correlation

Корреляция равна =  0.41

          SibSp     Parch
SibSp  1.000000  0.414838
Parch  0.414838  1.000000

###### 6. Самое популярное женское имя на корабле

In [128]:
female_names = df[df['Sex'] == 'female']['Name']
names = []
for name in female_names:
    name = name.split(', ')[1].split('. ')[1]
    try:
        if '(' and ')' in name:
            name = re.findall(r'\(.*?\)', name)[0].lstrip('(').rstrip(')').split(' ')[0]
        else:
            names.append(name.split(' ')[0])
    except IndexError:
        continue
print('Самое популярное женское имя на корабле:', collections.Counter(names).most_common()[0][0])

Самое популярное женское имя на корабле: Anna